app/controllers/contact_models_controller.rb

SELECT "contact_models".* FROM "contact_models"
---
  def index
    @contact_models = ContactModel.all

INSERT INTO "contact_models" ("name", "telefone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "creuza"], ["telefone", "40028922"], ["created_at", "2019-11-10 21:40:17.730979"], ["updated_at", "2019-11-10 21:40:17.730979"]]
---
  def create
    @contact_model = ContactModel.new(contact_model_params)

    respond_to do |format|
      if @contact_model.save

DELETE FROM "contact_models" WHERE "contact_models"."id" = $1  [["id", 1]]
---
  def destroy
    @contact_model.destroy

SELECT  "contact_models".* FROM "contact_models" WHERE "contact_models"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_contact_model
      @contact_model = ContactModel.find(params[:id])